In [1]:
import pandas as pd

### 1. Make your own dataframe

In [2]:
my_dict = {'Name':['Adam', 'Jessica', 'Taylor', 'Sam', 'Josh'], 
           'Age':[33, 45, 32, 14, 22],
           'Job':['Engineer', 'Accountant', 'Manager', 'Teller', 'Data Scientist']}

In [3]:
my_df = pd.DataFrame(my_dict)

In [4]:
my_df

      Name  Age             Job
0     Adam   33        Engineer
1  Jessica   45      Accountant
2   Taylor   32         Manager
3      Sam   14          Teller
4     Josh   22  Data Scientist

### 2. Import dataframes from the internet

In [5]:
# read the url
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

titanic_data = pd.read_csv(url)

In [7]:
titanic_data.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [8]:
titanic_data.shape

(1313, 6)

#### 2.1. Selecting a column

In [18]:
titanic_data.Survived

0       1
1       0
2       0
3       0
4       1
       ..
1308    0
1309    0
1310    0
1311    0
1312    0
Name: Survived, Length: 1313, dtype: int64

In [14]:
titanic_data.Age.head()

0    29.00
1     2.00
2    30.00
3    25.00
4     0.92
Name: Age, dtype: float64

#### 2.2 Selecting a column using brackets

In [17]:
titanic_data['Age'].head()

0    29.00
1     2.00
2    30.00
3    25.00
4     0.92
Name: Age, dtype: float64

In [19]:
titanic_data['Survived']

0       1
1       0
2       0
3       0
4       1
       ..
1308    0
1309    0
1310    0
1311    0
1312    0
Name: Survived, Length: 1313, dtype: int64

#### 2.3. Selecting multiple columns

In [23]:
titanic_data_subset = titanic_data[['Age', 'Survived', 'Sex']]

In [25]:
titanic_data_subset.shape

(1313, 3)